## Merge and joins
In SQL we know how to join tables. In Pandas we can do the same. We take a look at the pd.merge and pd.join methods.

1. Read the files customer.csv, products.csv, sales.csv, prod_suppliers.csv into 4 different dataframes. Let's use the names  df_customer, df_product,df_sales, df_prod_supplier and take a look at the content of the different tables.

In [1]:
import numpy as np
import pandas as pd

In [55]:
df_customer = pd.read_csv('data/customer.csv')
df_sales = pd.read_csv('data/sales.csv')
df_product = pd.read_csv('data/products.csv')
df_prod_supplier=pd.read_csv('data/prod_suppliers.csv')
df_supplier=pd.read_csv('data/suppliers.csv')
df_prod_supplier2=pd.read_csv('data/prod_suppliers2.csv')
df_product1=pd.read_csv('data/products.csv')
df_product2=pd.read_csv('data/products2.csv')
df_product3=pd.read_csv('data/products3.csv')

In [10]:
print(df_customer)
print(df_product)
print(df_sales)
print(df_prod_supplier)

   c_id Customer
0     1     Rabi
1     2     Raju
2     3     Alex
3     4     Rani
4     5     King
5     7     Ronn
6     8      Jem
7     9      Tom
   p_id       product  price
0     1     Hard Disk     80
1     2           RAM     90
2     3       Monitor     75
3     4           CPU     55
4     5      Keyboard     20
5     6         Mouse     10
6     7   Motherboard     50
7     8  Power supply     20
   sale_id  c_id  p_id  product  qty store
0        1     2     3  Monitor    2   ABC
1        2     2     4      CPU    1   DEF
2        3     1     3  Monitor    3   ABC
3        4     4     2      RAM    2   DEF
4        5     2     3  Monitor    3   ABC
5        6     3     3  Monitor    2   DEF
6        7     2     2      RAM    3   ABC
7        8     3     2      RAM    2   DEF
8        9     2     3  Monitor    2   ABC
   p_id  supp_id      suppliername
0     1        1  Hypertek Systems
1     2        1  Hypertek Systems
2     3        2   informatique.nl
3     8        1  Hypertek Systems
4     4        3    centurytech.sg
5     5        3    centurytech.sg
6     6        2   informatique.nl
7     7        3    centurytech.sg

### One -to-one joins

2. Construct a new dataframe df_product_extended which adds the columns supp_id and suppliername to df_products.Verify if the operation is ok.

In [14]:
df_product_extended = pd.merge(df_product, df_prod_supplier)
print(df_product)
print(df_prod_supplier)

   p_id       product  price
0     1     Hard Disk     80
1     2           RAM     90
2     3       Monitor     75
3     4           CPU     55
4     5      Keyboard     20
5     6         Mouse     10
6     7   Motherboard     50
7     8  Power supply     20
   p_id  supp_id      suppliername
0     1        1  Hypertek Systems
1     2        1  Hypertek Systems
2     3        2   informatique.nl
3     8        1  Hypertek Systems
4     4        3    centurytech.sg
5     5        3    centurytech.sg
6     6        2   informatique.nl
7     7        3    centurytech.sg

In [13]:
print(df_product_extended)

   p_id       product  price  supp_id      suppliername
0     1     Hard Disk     80        1  Hypertek Systems
1     2           RAM     90        1  Hypertek Systems
2     3       Monitor     75        2   informatique.nl
3     4           CPU     55        3    centurytech.sg
4     5      Keyboard     20        3    centurytech.sg
5     6         Mouse     10        2   informatique.nl
6     7   Motherboard     50        3    centurytech.sg
7     8  Power supply     20        1  Hypertek Systems

3. What did you notice about the merge?

A. It "knows" that p_id is the join key (in SQL we needed to specify the join key)
B. The rows do not need to appear in the same order (e.g. Power supply p_id 8 was in row 4 for the prod_supplier table) )

### Many-to-one joins (similar to SQL INNER JOIN)

4. We also have a file suppliers.csv. Create a dataframe df_supplier which contains extended information of our suppliers (in prod_supplier we only see the supp_id and suppliername). How can we create a table with the prod_supplier information and also the emails, phone numbers and address of the suppliers? Identify the new dataframe as df_prod_extended_supplier

 df_supplier=read_csv("data/suppliers.csv")
 df_supplier.head()

In [21]:
df_supplier = pd.read_csv('data/suppliers.csv')
df_supplier

,supp_id,suppliername,email,phone,address
0,1,Hypertek Systems,sales@hypertek.be,3256894514,Groenplaats 4 Antwerpen
1,2,informatique.nl,info@informatique.nl,312335679,Willem2plein 3 Rotterdam
2,3,centurytech.sg,info@centurytech.sg,657754637,China Tower 3 Singapore

In [29]:
df_prod_extended_supplier = pd.merge(df_prod_supplier, df_supplier)
df_prod_extended_supplier

,p_id,supp_id,suppliername,email,phone,address
0,1,1,Hypertek Systems,sales@hypertek.be,3256894514,Groenplaats 4 Antwerpen
1,2,1,Hypertek Systems,sales@hypertek.be,3256894514,Groenplaats 4 Antwerpen
2,3,2,informatique.nl,info@informatique.nl,312335679,Willem2plein 3 Rotterdam
3,8,1,Hypertek Systems,sales@hypertek.be,3256894514,Groenplaats 4 Antwerpen
4,4,3,centurytech.sg,info@centurytech.sg,657754637,China Tower 3 Singapore
5,5,3,centurytech.sg,info@centurytech.sg,657754637,China Tower 3 Singapore
6,6,2,informatique.nl,info@informatique.nl,312335679,Willem2plein 3 Rotterdam
7,7,3,centurytech.sg,info@centurytech.sg,657754637,China Tower 3 Singapore

5. What happens when in one of the files you have supplier_name instead of suppliername?

We see the column suppliername and the column supplier_name!

### Many-to-many joins (compare it with cartesian join or cross join in SQL)

Consider a dataframe which for every major contains a list of courses.

In [30]:
data_courses = {
    'major': ['AI', 'AI','AI','Infrastructure & System Engineering','Infrastructure & System Engineering', 'Infrastructure & System Engineering','Application Development','Application Development','Application Development','Application Development','Application Development','Application Development'],
    'courses': [
        'Machine Learning', 'Deep Learning', 'Natural Language Processing',
        'Network Security', 'Cloud Computing', 'Database Management',
        'Software Engineering', 'Systems Design', 'Embedded Systems',
        'Web Development', 'Mobile App Development', 'Software Testing'
    ]
}

In [31]:
df_courses=pd.DataFrame(data_courses)

In [32]:
df_courses

                                  major                      courses
0                                    AI             Machine Learning
1                                    AI                Deep Learning
2                                    AI  Natural Language Processing
3   Infrastructure & System Engineering             Network Security
4   Infrastructure & System Engineering              Cloud Computing
5   Infrastructure & System Engineering          Database Management
6               Application Development         Software Engineering
7               Application Development               Systems Design
8               Application Development             Embedded Systems
9               Application Development              Web Development
10              Application Development       Mobile App Development
11              Application Development             Software Testing

Next we consider students who participate in one of the majors.

In [33]:
data = {
    'student_name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'major': ['AI', 'Infrastructure & System Engineering', 'Infrastructure & System Engineering', 'Application Development', 'AI', 'Application Development']
}

# Create the DataFrame
df_students= pd.DataFrame(data)

# Display the DataFrame
print(df_students)

  student_name                                major
0        Alice                                   AI
1          Bob  Infrastructure & System Engineering
2      Charlie  Infrastructure & System Engineering
3        David              Application Development
4          Eva                                   AI
5        Frank              Application Development

8. Construct a list of all the courses a student needs to follow.

In [37]:
df_list_courses_students = pd.merge(df_courses, df_students)

In [38]:
df_list_courses_students

,major,courses,student_name
0,AI,Machine Learning,Alice
1,AI,Machine Learning,Eva
2,AI,Deep Learning,Alice
3,AI,Deep Learning,Eva
4,AI,Natural Language Processing,Alice
5,AI,Natural Language Processing,Eva
6,Infrastructure & System Engineering,Network Security,Bob
7,Infrastructure & System Engineering,Network Security,Charlie
8,Infrastructure & System Engineering,Cloud Computing,Bob
9,Infrastructure & System Engineering,Cloud Computing,Charlie
10,Infrastructure & System Engineering,Database Management,Bob
11,Infrastructure & System Engineering,Database Management,Charlie
12,Application Development,Software Engineering,David
13,Application Development,Software Engineering,Frank
14,Application Development,Systems Design,David
15,Application Development,Systems Design,Frank
16,Application Development,Embedded Systems,David
17,Application Development,Embedded Systems,Frank
18,Application Development,Web Development,David
19,Application Development,Web Development,Frank
20,Application Development,Mobile App Development,David
21,Application Development,Mobile App Development,Frank
22,Application Development,Software Testing,David
23,Application Development,Software Testing,Frank

### Merge keys

In SQL we have the option to specify the join-key, in Pandas we can do the same and avoid problems that columns have different labels but the same content.

9. Read the file prod_suppliers2.csv next in Suppliers.csv we still have suppliersname but in prod_suppliers we call this column supplier (also supp_id is omitted). How do you join the two tables without changing the columns names and in the end you keep suppliername in the table?

In [39]:
df_prod_supplier2

   p_id          supplier
0     1  Hypertek Systems
1     2  Hypertek Systems
2     3   informatique.nl
3     8  Hypertek Systems
4     4    centurytech.sg
5     5    centurytech.sg
6     6   informatique.nl
7     7    centurytech.sg

In [46]:
df_prod_supplier_name = pd.merge(df_prod_supplier, df_prod_supplier2, left_on="suppliername", right_on="supplier")
df_prod_supplier_name.drop('supplier', axis=1, inplace=True)
df_prod_supplier_name

    p_id_x  supp_id      suppliername  p_id_y
0        1        1  Hypertek Systems       1
1        1        1  Hypertek Systems       2
2        1        1  Hypertek Systems       8
3        2        1  Hypertek Systems       1
4        2        1  Hypertek Systems       2
5        2        1  Hypertek Systems       8
6        3        2   informatique.nl       3
7        3        2   informatique.nl       6
8        8        1  Hypertek Systems       1
9        8        1  Hypertek Systems       2
10       8        1  Hypertek Systems       8
11       4        3    centurytech.sg       4
12       4        3    centurytech.sg       5
13       4        3    centurytech.sg       7
14       5        3    centurytech.sg       4
15       5        3    centurytech.sg       5
16       5        3    centurytech.sg       7
17       6        2   informatique.nl       3
18       6        2   informatique.nl       6
19       7        3    centurytech.sg       4
20       7        3    centurytech.sg       5
21       7        3    centurytech.sg       7

10. a. Take df_product and df_prod_supplier2 transform the p_id in an index

    b. Merge the two tables on the index

    c. Do the same but use the join method of Pandas

    d. Verify that both are the same

In [56]:
df_product.set_index('p_id', inplace=True)
df_prod_supplier2.set_index('p_id', inplace=True)
print(df_product)
print(df_prod_supplier2)

           product  price
p_id
1        Hard Disk     80
2              RAM     90
3          Monitor     75
4              CPU     55
5         Keyboard     20
6            Mouse     10
7      Motherboard     50
8     Power supply     20
              supplier
p_id
1     Hypertek Systems
2     Hypertek Systems
3      informatique.nl
8     Hypertek Systems
4       centurytech.sg
5       centurytech.sg
6      informatique.nl
7       centurytech.sg

In [68]:
df_product_supplier_merged = pd.merge(df_product, df_prod_supplier2, left_index=True, right_index=True)
df_product_supplier_merged_join = df_product.join(df_prod_supplier2)
print(df_product_supplier_merged) 
print()
print(df_product_supplier_merged_join)

           product  price          supplier
p_id
1        Hard Disk     80  Hypertek Systems
2              RAM     90  Hypertek Systems
3          Monitor     75   informatique.nl
4              CPU     55    centurytech.sg
5         Keyboard     20    centurytech.sg
6            Mouse     10   informatique.nl
7      Motherboard     50    centurytech.sg
8     Power supply     20  Hypertek Systems

           product  price          supplier
p_id
1        Hard Disk     80  Hypertek Systems
2              RAM     90  Hypertek Systems
3          Monitor     75   informatique.nl
4              CPU     55    centurytech.sg
5         Keyboard     20    centurytech.sg
6            Mouse     10   informatique.nl
7      Motherboard     50    centurytech.sg
8     Power supply     20  Hypertek Systems

11. a.Merge the sales, prod_suppliers and products into one dataframe. What wil you merge first

    b.How do you avoid having double columns?

In [84]:
# best way to do it lol
dfs = pd.merge(df_product, df_prod_supplier, left_index=True, right_on='p_id')
dfs = pd.merge(dfs, df_sales)
dfs.set_index('p_id', inplace=True)
dfs

      product  price  supp_id      suppliername  sale_id  c_id  qty store
p_id
2         RAM     90        1  Hypertek Systems        4     4    2   DEF
2         RAM     90        1  Hypertek Systems        7     2    3   ABC
2         RAM     90        1  Hypertek Systems        8     3    2   DEF
3     Monitor     75        2   informatique.nl        1     2    2   ABC
3     Monitor     75        2   informatique.nl        3     1    3   ABC
3     Monitor     75        2   informatique.nl        5     2    3   ABC
3     Monitor     75        2   informatique.nl        6     3    2   DEF
3     Monitor     75        2   informatique.nl        9     2    2   ABC
4         CPU     55        3    centurytech.sg        2     2    1   DEF

In [104]:
# one way to do it (by teacher) which mine is better but anyway
df_temp = pd.merge(df_sales, df_product, left_on=['p_id', 'product'], right_on=['p_id', 'product'])
# df_temp
df_final = pd.merge(df_temp, df_prod_supplier)
# df_final.drop('product_y', axis=1, inplace=True)
# df_final.columns=['sale_id', 'c_id', 'p_id', 'product', 'B', 'C', 'A', 'D', 'F']
# df_final.iloc[:, 3].column='product'
df_final

   sale_id  c_id  p_id  product  qty store  price  supp_id      suppliername
0        1     2     3  Monitor    2   ABC     75        2   informatique.nl
1        2     2     4      CPU    1   DEF     55        3    centurytech.sg
2        3     1     3  Monitor    3   ABC     75        2   informatique.nl
3        4     4     2      RAM    2   DEF     90        1  Hypertek Systems
4        5     2     3  Monitor    3   ABC     75        2   informatique.nl
5        6     3     3  Monitor    2   DEF     75        2   informatique.nl
6        7     2     2      RAM    3   ABC     90        1  Hypertek Systems
7        8     3     2      RAM    2   DEF     90        1  Hypertek Systems
8        9     2     3  Monitor    2   ABC     75        2   informatique.nl

### What about left, right and outer joins?

In SQL we have the notion of a left and right join and an outer join. What are the pandas counterparts?
Let's review our student example

In [115]:
print(df_students)

  student_name                                major
0        Alice                                   AI
1          Bob  Infrastructure & System Engineering
2      Charlie  Infrastructure & System Engineering
3        David              Application Development
4          Eva                                   AI
5        Frank              Application Development

12. Suppose that our students also have the option to have a minor:
a. Make a Dataframe with a column student_name and a column minor
Alice takes the minor French communication and Frank chooses LLM. Ali finished the major but still wants to add a minor in Cybersecurity on his CV label this Dataframe as df_minor
b. Merge the df_students with df_minor. What happens?
c. Do we have duplicate columns? How do we drop them?
d Construct a dataframe with all the information of all the students
e. Construct a dataframe with all the information of the majors and optional that of the minors
f. Construct a dataframe with all the info about the minors and optional that of the majors

In [126]:
data={'Student_name':['Alice','Frank','Ali'],'Minor':['French communication','LLM','Cybersecurity']}
df_minor=pd.DataFrame(data)

In [122]:
df_minor

  Student_name                 Minor
0        Alice  French communication
1        Frank                   LLM
2          Ali         Cybersecurity

In [127]:
#b
df=pd.merge(df_students,df_minor,left_on='student_name',right_on='Student_name')
print(df)
#c
df=df.drop('Student_name',axis=1)
print(df)

  student_name                    major Student_name                 Minor
0        Alice                       AI        Alice  French communication
1        Frank  Application Development        Frank                   LLM
  student_name                    major                 Minor
0        Alice                       AI  French communication
1        Frank  Application Development                   LLM

In [132]:
# d Construct a dataframe with all the information of all the students
df_all = pd.merge(df_students, df_minor, left_on="student_name", right_on="Student_name", how="outer")
df_all

,student_name,major,Student_name,Minor
0,NaN,NaN,Ali,Cybersecurity
1,Alice,AI,Alice,French communication
2,Bob,Infrastructure & System Engineering,NaN,NaN
3,Charlie,Infrastructure & System Engineering,NaN,NaN
4,David,Application Development,NaN,NaN
5,Eva,AI,NaN,NaN
6,Frank,Application Development,Frank,LLM

In [133]:
# e. Construct a dataframe with all the information of the majors and optional that of the minors
df_majors = pd.merge(df_students, df_minor, left_on="student_name", right_on="Student_name", how="left")
df_majors

,student_name,major,Student_name,Minor
0,Alice,AI,Alice,French communication
1,Bob,Infrastructure & System Engineering,NaN,NaN
2,Charlie,Infrastructure & System Engineering,NaN,NaN
3,David,Application Development,NaN,NaN
4,Eva,AI,NaN,NaN
5,Frank,Application Development,Frank,LLM

In [134]:
# f. Construct a dataframe with all the info about the minors and optional that of the majors
df_minors_all = pd.merge(df_students, df_minor, left_on="student_name", right_on="Student_name", how="right")
df_minors_all

  student_name                    major Student_name                 Minor
0        Alice                       AI        Alice  French communication
1        Frank  Application Development        Frank                   LLM
2          NaN                      NaN          Ali         Cybersecurity

## Concatenate
To concatenate dataframes or series in Pandas (pd.concat()) is comparable with UNION operation in SQL and of course it also in line with the numpy method np.concatenate().

13. a. Read the files products.csv, products2.csv and products3.csv into the dataframes df_product1, df_product2 and df_product3.

b. Look at the content and make one file of it: products_complete.csv
(Hint: read everything in dataframes and next combine the dataframe in one big dataframe, subsequently write the file products_complete.csv)

In [137]:
df_product1 = pd.read_csv('data/products.csv')
df_product2 = pd.read_csv('data/products2.csv')
df_product3 = pd.read_csv('data/products3.csv')

In [153]:
print(df_product1)

   p_id       product  price
0     1     Hard Disk     80
1     2           RAM     90
2     3       Monitor     75
3     4           CPU     55
4     5      Keyboard     20
5     6         Mouse     10
6     7   Motherboard     50
7     8  Power supply     20

In [154]:
print(df_product2)

   p_id        product  price
0     9  Graphics Card    150
1    10            SSD     60
2    11       Speakers     30
3    12         Webcam     25

In [155]:
print(df_product3)

   p_id        product  price
0    13        USB Hub     15
1    14    Cooling Fan     20
2    15  Optical Drive     35
3    16           Case     40
4    17        Headset     45

In [160]:
df_products123 = pd.concat([df_product1, df_product2, df_product3], ignore_index=True)
print(df_products123)

    p_id        product  price
0      1      Hard Disk     80
1      2            RAM     90
2      3        Monitor     75
3      4            CPU     55
4      5       Keyboard     20
5      6          Mouse     10
6      7    Motherboard     50
7      8   Power supply     20
8      9  Graphics Card    150
9     10            SSD     60
10    11       Speakers     30
11    12         Webcam     25
12    13        USB Hub     15
13    14    Cooling Fan     20
14    15  Optical Drive     35
15    16           Case     40
16    17        Headset     45

In [163]:
df_products123.to_csv('data/products_complete.csv')

Let's recall the function make_df to construct some dataframes

In [6]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)
df1=make_df("THIS",[0,1,2])

2. a.How do you create with concat the following dataframe?
   b.What method will accomplish the same?

In [7]:
#this is a part of the question
print(pd.read_csv('data/thisfor.csv'))

FileNotFoundError: [Errno 2] No such file or directory: 'data/thisfor.csv'

In [ ]:
# in the book we also see something like df=pd.concat([df1,df2],axis='col') this is however an error!

## References
An article that explains the difference between join and merge:
https://sparkbyexamples.com/pandas/pandas-join-vs-merge-explained-differences/#google_vi
For merge,join and concatenate:https://pandas.pydata.org/docs/user_guide/merging.html
For joins see: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html